/*
 *  задание_C18_контеста
 * Функция подсчета количество цифр в введенной строке
  */

#include <stdio.h>

char c;
int sum = 0, int_c = 0;

int digit_to_num(char);		//прототип функции

int main() {
    
    while ((c = getchar())!='.') { // Читаем один символ
	digit_to_num(c);	//вызываем функцию	
	}
	
	printf("%d\n", sum);
	
    return 0;
}

/* ********        определение функции            *******/

int digit_to_num(char c) {
	
							// Проверяем, является ли символ цифрой
	if (c >= '0' && c <= '9') {
		int_c = c - '0';	//перевод символа в цифру
		sum += int_c;		//сумма цифр
	}
	return sum;				//возврат значения суммы цифр
}
