/*
задание_C4_контеста
функция определения четности суммы цифр вводимого числа  'N'
 ответ в виде "YES" или  "NO"
*/

#include <stdio.h>

int N;

void function(int);    //прототип функции

int main (void) {

   scanf("%d", &N);
   function(N);   //вызов функции
      
    return 0;
}

//определение функции подсчета суммы цифр числа N 
void function(int N) {
	int sum = 0;
    while (N > 0) {
	sum += (N%10);	//последняя цифра числа со сложением результата
	N/=10;		//отброс последней цифры числа
	}
	((sum%2)==0) ? puts("YES") : puts("NO"); 
   
}

