/*
задание_С6_контеста
функция подсчета количества зерен риса для мудреца
 по введенному количеству клеток шахмат  'N'
 
*/

#include <stdio.h>
#include <stdint.h>

uint64_t res = 1;		//результат вычисления функции


uint64_t rice(unsigned int);    //прототип функции подсчета риса

int main (void) {
	unsigned int N;
	scanf("%d", &N);
	rice(N);   //вызов функции
	printf("%llu\n", (uint64_t)res);
   
    return 0;
}
/*
 * ***********************************************************
//определение функции подсчета зерен риса по количеству клеток шахмат N
//с пмощью цикла
uint64_t rice(unsigned int N) {
	
    for (int i=1; i < N ; i++) {
	res *= 2;
    }
    
   return res;
}
**************************************************************
*/

//определение функции подсчета зерен риса по количеству клеток шахмат N
//путем побитового сдвига

uint64_t rice(unsigned int N) {
	N = --N;
    res = res << N;
    
    
   return res;
}
