/*
 *  задание_C8_контеста
 * Функция преобразования строчных символов в заглавные
  */

#include <stdio.h>

char c;

void function(char);	//прототип функции

int main() {
    
    while ((c = getchar())!='.') { // Читаем один символ
	function(c);	//вызываем функцию	

	}
    return 0;
}

void function(char с) {
// Проверяем, является ли символ заглавной буквой
	if (c >= 'a' && c <= 'z') {
	// Преобразуем в строчную букву
	c = c - ('a' - 'A'); // или c = c - 32;
	}
	putchar(c); // Выводим результат в консоль
}
