/*
 *  задание_А15_контеста
 *
 При решении системы уравнений,
 описывающих прямую через две точки,
 вида: y1=k*x1+b и y2=k*x2+b
 коэффициенты k и b имеют вид:
 k=(y2-y1)/(x2-x1);
 b=y1-((y2-y1)*x1)/(x2-x1);
 * 
 */

#include <stdio.h>

signed int x1, y1, x2, y2;
float k, b;

int main(void)
{
	scanf ("%d %d %d %d",&x1, &y1, &x2, &y2);
	
	//применяем выведенные формулы
	k=(float)(y2-y1)/(x2-x1);
	b=y1-(((y2-y1)*x1)/(float)(x2-x1));
	
		
	//вывод результата на дисплей
	printf ("%.2f %.2f\n",k,b);
	
	return 0;
}

