/*
 Задание А0 контест А "продвинутый Си"
На стандартном потоке ввода задаётся натуральное число N (N > 0), 
после которого следует последовательность из N целых чисел.
На стандартный поток вывода напечатайте, сколько раз
 в этой последовательности встречается максимум.
*/

#include <stdio.h>

int main () {
	int count = 1, N, num, max;
	
	scanf("%d", &N);	//количество элементов

    //операции с последующими элементами
	for (int i=0; i<N; i++) {
		scanf("%d", &num);
		

		if (num > max) {
			max = num;
			count = 1;
		}
		else if (num == max) {
			max = num;
			count++;
		}
		
	}
	
		
	printf("%d\n", count);
}
