/*
Задание А1 контеста "Продвинутый СИ"
Шифр Цезара
На stdin задается целое неотрицательное число N
 и последовательность символов с "." в конце.
Требуется закодировать символы шифром Цезаря.
Символ с номером n кодируется как:
р=(n+N)mod K; где mod - операция взятия остатка
К - число символов в алфавите
На stdout вывести зашифрованное сообщение с окончанием "."
*/

#include <stdio.h>

int main() {
    int N;
    char ch;

    // Считываем число N
    scanf("%d", &N);

    // Читаем символы до точки
    while ((ch = getchar()) != '.') {
        // Проверяем, является ли символ буквой
        if (ch >= 'A' && ch <= 'Z') {
            // Вычисляем новый символ с учетом сдвига
            ch = (ch - 'A' + N) % 26 + 'A';
            putchar(ch);
        }
        else
            if (ch >= 'a' && ch <= 'z') {
            // Для строчных букв
            ch = (ch - 'a' + N) % 26 + 'a';
            putchar(ch);
        }
        else {
            putchar(ch);  // Пробелы и другие символы остаются без изменений
        }
    }

    putchar('.');  // Добавляем точку в конец
    return 0;
}
