/*
Задание А4 контест А "продвинутый Си"
На вход программе подается беззнаковое 32-битное целое число N 
и натуральное число K (1 ≤ K ≤ 31). 
Требуется взять K подряд идущих битов числа N так, чтобы
 полученное число было максимальным. 
Программа должна вывести полученное число.
*/

#include <stdio.h>
#include <stdint.h>

int main() {
    unsigned int N, K;
    
    // Ввод данных
    scanf("%u %u", &N, &K);
    
    // Находим максимальное значение из K бит
    unsigned int max_value = 0;
    for (unsigned int i = 0; i < K; i++) {
        // Проверяем каждый бит в диапазоне
        if ((N & (1 << i)) > max_value) {
            max_value = N & (1 << i);
        }
    }
    
    printf("%u\n", max_value);
    return 0;
    
}
