/*
Задание À6 контест А "Продвинутый Си"
На вход программе подается беззнаковое 32-битное целое число N.
Требуется изменить значения всех битов старшего байта числа на
 противоположные и вывести полученное таким образом число
*/

#include <stdio.h>
#include <stdint.h>

int main() {

    uint32_t N, rev_N, masc = 0xFF000000;
    scanf("%u", &N);

//    // использование маски
//    rev_N = N ^ masc;
//

//    // использование регистрового сдвига с циклом
    rev_N = N;
    for(int i=24; i<32; i++) {
    rev_N ^= (1 << i);
    }

    printf("%u",rev_N);
    return 0;
}
