#include <stdio.h>

/*
* Задание_F3_контест
* Функция вывода в порядке возрастания цифр числа с подсчетом
* количества повторений
*
*/


void num_count(char, int a[]);//прототип функции

int main() {
    int a[10] = {0};         //инициализация массива с индексами от 0 до 9
    char c;
    while ((c = getchar()) != '\n') {
        num_count(c, a);    //вызов функции
    }
    //вывод массива-счетчика в консоль
    for (int i = 0; i < 10; i++) {
		if (a[i] != 0) {
            printf("%d %d\n", i, a[i]);
		}
    }
    return 0;
}
/* ************ определение функций ****************/
//функция перевода символа числа в число с подсчетом повторений
void num_count(char c, int a[]) {

    int digit = c - '0';    //перевод символа в число
	a[digit]++;             //счетчик повторений


/*	for (int i = 0; i < 10; i++) {
		if (a[i] != 0) {
            printf("%d %d\n", i, a[i]);
		}
	}
*/

/*
	if (digit == 0) {
		a[digit]++;
		printf("%d %d\n", digit, a[digit]);
	}
}
*/
}
