#include <stdio.h>
#define SIZE 10
/*
* Задание_F4_контест
* Функция вывода в порядке возрастания цифр с подсчетом
* количества повторений из строки
*
*/

void print_digit(char s[]); //прототип функции

int main() {
    char c, s[SIZE];   //инициализация массива
    int i = 0; //счетчик цикла
    //запись строки в массив посимвольно
    while ((c = getchar()) != '\n') {
        s[i++] = c;
    }
    s[i] = '\0';

    //вызов функции
    //print_digit(s);
    for (int i = 0; i < SIZE; i++) printf("%s", s[i]);

    return 0;
}
/* ************ определение функций ****************/
//функция перевода символа числа в число с подсчетом повторений
void print_digit(char s[]) {
    int digit_count[SIZE] = {0}; //счетчик повторений
    for (int i=0; i < SIZE; i++ ) { //проходим массив
        if (s[i] >= '0' && s[i] <= '9') { //проверка на символ цифры
            digit_count[s[i] - '0']++; //увеличиваем счетчик
        }

    }
    // Выводим результат в порядке возрастания цифр
    for (int i = 0; i < SIZE; i++) {
        if (digit_count[i] > 0) {
            printf("%d %d\n", i, digit_count[i]);
        }
    }

}
